k6/findpath/smoke.log

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: smoke.js
     output: -

  scenarios: (100.00%) 1 scenario, 1 max VUs, 40s max duration (incl. graceful stop):
           * default: 1 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 1 VUs  01.0s/10s

running (02.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
default   [  20% ] 1 VUs  02.0s/10s

running (03.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
default   [  30% ] 1 VUs  03.0s/10s

running (04.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
default   [  40% ] 1 VUs  04.0s/10s

running (05.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
default   [  50% ] 1 VUs  05.0s/10s

running (06.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
default   [  60% ] 1 VUs  06.0s/10s

running (07.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
default   [  70% ] 1 VUs  07.0s/10s

running (08.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
default   [  80% ] 1 VUs  08.0s/10s

running (09.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
default   [  90% ] 1 VUs  09.0s/10s

running (10.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
default   [ 100% ] 1 VUs  10.0s/10s

running (10.1s), 0/1 VUs, 10 complete and 0 interrupted iterations
default ✓ [ 100% ] 1 VUs  10s

     ✗ find path
      ↳  0% — ✓ 0 / ✗ 10

     checks.....................: 0.00%   ✓ 0        ✗ 10 
     data_received..............: 11 kB   1.0 kB/s
     data_sent..................: 1.0 kB  104 B/s
     http_req_blocked...........: avg=1.93ms   min=3.03µs   med=3.21µs   max=19.3ms   p(90)=1.93ms   p(95)=10.61ms 
     http_req_connecting........: avg=117.32µs min=0s       med=0s       max=1.17ms   p(90)=117.32µs p(95)=645.26µs
   ✓ http_req_duration..........: avg=4.7ms    min=4.04ms   med=4.32ms   max=8.3ms    p(90)=4.98ms   p(95)=6.64ms  
     http_req_failed............: 100.00% ✓ 10       ✗ 0  
     http_req_receiving.........: avg=76.29µs  min=61.81µs  med=72.31µs  max=103.83µs p(90)=102.82µs p(95)=103.33µs
     http_req_sending...........: avg=116.96µs min=103.05µs med=112.33µs max=169.93µs p(90)=126.83µs p(95)=148.38µs
     http_req_tls_handshaking...: avg=1.72ms   min=0s       med=0s       max=17.27ms  p(90)=1.72ms   p(95)=9.5ms   
     http_req_waiting...........: avg=4.51ms   min=3.87ms   med=4.14ms   max=8.02ms   p(90)=4.78ms   p(95)=6.4ms   
     http_reqs..................: 10      0.992621/s
     iteration_duration.........: avg=1s       min=1s       med=1s       max=1.02s    p(90)=1s       p(95)=1.01s   
     iterations.................: 10      0.992621/s
     vus........................: 1       min=1      max=1
     vus_max....................: 1       min=1      max=1